[
    {"id": 1, "name": "Processing", "description": "Processing is a flexible software sketchbook and a language for learning how to code within the context of the visual arts. It is an open-source graphical library and integrated development environment (IDE) built for the electronic arts, new media art, and visual design communities."},
    {"id": 2, "name": "Cinder", "description": "Cinder is a community-developed, free and open-source library for professional-quality creative coding in C++. It is used for the development of applications that involve graphics, audio, video, networking, and computational geometry."},
    {"id": 3, "name": "openFrameworks", "description": "openFrameworks is an open-source C++ toolkit designed to assist the creative process by providing a simple and intuitive framework for experimentation. It is popular among artists, designers, and educators for its easy-to-use tools for real-time graphics."},
    {"id": 4, "name": "C4", "description": "C4 is an open-source, cross-platform framework for creative coding. It provides tools for artists, designers, and educators to quickly prototype interactive applications. The framework is built on top of Apple's Core Graphics and Core Animation libraries."},
    {"id": 5, "name": "Unity", "description": "Unity is a powerful cross-platform game engine used for creating both two and three-dimensional video games and simulations. It is widely adopted in various industries including gaming, film, automotive, and architecture."},
    {"id": 6, "name": "Godot", "description": "Godot is an advanced, feature-packed, multi-platform 2D and 3D open-source game engine. It provides a comprehensive set of common tools, so users can focus on making games without having to reinvent the wheel."},
    {"id": 7, "name": "PlayCanvas", "description": "PlayCanvas is an open-source, WebGL game engine designed for creating interactive 3D content in the browser. It is known for its real-time collaboration features, allowing multiple developers to work together seamlessly."},
    {"id": 8, "name": "hg_sdf", "description": "hg_sdf is a tool for creating signed distance functions (SDFs) and rendering them using ray marching. It is used for creating complex 3D shapes and effects with minimal code."},
    {"id": 9, "name": "nannou", "description": "nannou is a creative coding framework for Rust that makes it easy to express ideas with simple, fast, reliable code. It is designed for real-time application development and offers tools for creating audio-visual interactive experiences."},
    {"id": 10, "name": "thi.ng", "description": "thi.ng is a collection of open-source tools and libraries for functional programming, data visualization, and creative coding. It includes modules for working with geometric shapes, color spaces, and various other creative tasks."},
    {"id": 11, "name": "PixelKit", "description": "PixelKit is a toolkit for creating pixel art and animations. It provides a range of tools and features designed to help artists create detailed and complex pixel art with ease."},
    {"id": 12, "name": "OPENRNDR", "description": "OPENRNDR is an open-source framework for creative coding written in Kotlin. It is designed to make it easy to create real-time interactive graphics, with a focus on simplicity and performance."},
    {"id": 13, "name": "Phaser", "description": "Phaser is a fast, free, and fun open-source HTML5 game framework. It offers a rich suite of tools and features for creating both 2D and 3D games, and is popular among indie game developers."},
    {"id": 14, "name": "Canvas-sketch", "description": "Canvas-sketch is a JavaScript framework for creating generative art and creative coding sketches. It provides a range of tools for working with the HTML5 canvas and creating interactive and visually appealing graphics."},
    {"id": 15, "name": "AsyncGraphics", "description": "AsyncGraphics is a library for asynchronous rendering of graphics in JavaScript. It allows developers to create complex and interactive visualizations without blocking the main thread."},
    {"id": 16, "name": "Lygia", "description": "Lygia is a collection of reusable, efficient, and modular GLSL functions and tools for creative coding and shader development. It is designed to help developers create complex visual effects with minimal code."},
    {"id": 17, "name": "Fragment.tools", "description": "Fragment.tools is an online shader editor and live-coding environment for creating and sharing GLSL shaders. It provides an intuitive interface for experimenting with real-time graphics and visual effects."},
    {"id": 18, "name": "vvvv", "description": "vvvv is a hybrid visual/textual live-programming environment for easy prototyping and development. It is especially well-suited for creating interactive applications, installations, and performances."},
    {"id": 19, "name": "NodeBox", "description": "NodeBox is an open-source application for creating 2D graphics and visualizations using Python. It is designed for rapid prototyping and allows artists and designers to generate complex visuals programmatically."},
    {"id": 20, "name": "TouchDesigner", "description": "TouchDesigner is a node-based visual programming language for real-time interactive multimedia content. It is used for creating interactive installations, live performances, and data visualization."},
    {"id": 21, "name": "Quartz Composer", "description": "Quartz Composer is a visual programming language provided as part of the Xcode development environment in macOS. It is used for processing and rendering graphical data and creating interactive animations."},
    {"id": 22, "name": "Vuo", "description": "Vuo is a visual programming language for designing and deploying interactive media experiences. It provides an intuitive interface for creating multimedia applications without writing code."},
    {"id": 23, "name": "Max", "description": "Max is a visual programming language for music and multimedia. It allows users to create custom software for sound, graphics, and interactivity by connecting objects with virtual patch cords."},
    {"id": 24, "name": "Pure Data", "description": "Pure Data (Pd) is an open-source visual programming language for multimedia. It is used for creating interactive computer music and multimedia works and allows artists to manipulate audio and visual data in real-time."},
    {"id": 25, "name": "ossia score", "description": "ossia score is a free, open-source sequencer for interactive, multimedia-based performances. It is designed to control various media types and protocols, enabling complex and dynamic show control."},
    {"id": 26, "name": "tooll", "description": "tooll is a real-time compositing and effects tool for creating visual content. It provides a modular environment for building complex visual effects and interactive graphics."},
    {"id": 27, "name": "XOD", "description": "XOD is a visual programming language for microcontrollers and Internet of Things (IoT) devices. It allows users to create programs by connecting nodes, making it accessible for beginners and non-programmers."},
    {"id": 28, "name": "Isadora", "description": "Isadora is a tool for creating interactive multimedia performances and installations. It allows artists to manipulate video, audio, and other media in real-time using a visual programming interface."},
    {"id": 29, "name": "cables", "description": "cables is a visual programming environment for creating interactive web content. It allows users to build complex visual effects and interactions using a node-based interface and runs entirely in the browser."},
    {"id": 30, "name": "eternal", "description": "eternal is a creative coding environment for building interactive and generative art. It provides tools for working with graphics, sound, and interaction in a real-time, performance-oriented context."},
    {"id": 31, "name": "Notch Builder", "description": "Notch Builder is a real-time graphics and effects software used for creating interactive and live visual content. It is widely used in the live events and entertainment industry for projection mapping, VJing, and interactive installations."},
    {"id": 32, "name": "JOY.JS", "description": "JOY.JS is a JavaScript framework for creating interactive and generative art. It provides a simple API for working with the HTML5 canvas and creating visually appealing graphics and animations."},
    {"id": 33, "name": "Circles", "description": "Circles is a creative coding library for creating generative art and visualizations. It focuses on making it easy to work with geometric shapes and patterns, enabling artists to create complex visuals with minimal code."},
    {"id": 34, "name": "TIC-80", "description": "TIC-80 is a fantasy computer for making, playing, and sharing tiny games. It includes a built-in code editor, sprite editor, map editor, and music tracker, providing a complete development environment for creating retro-style games."},
    {"id": 35, "name": "SuperCollider", "description": "SuperCollider is a platform for audio synthesis and algorithmic composition. It provides an environment and programming language for real-time audio synthesis and algorithmic composition, widely used in electronic music and sound art."},
    {"id": 36, "name": "ChucK", "description": "ChucK is a programming language for real-time sound synthesis and music creation. It offers a unique, strongly-timed language for precise audio programming, making it popular among composers and researchers in computer music."},
    {"id": 37, "name": "TidalCycles", "description": "TidalCycles (or Tidal) is a live coding environment for creating music with code. It is designed for improvisational and algorithmic composition, enabling musicians to create complex patterns and rhythms in real-time."},
    {"id": 38, "name": "Sonic Pi", "description": "Sonic Pi is a code-based music creation and performance tool. It is designed to be simple and easy to use, making it a popular choice for live coding performances and educational purposes."},
    {"id": 39, "name": "Csound", "description": "Csound is a sound and music computing system which provides facilities for composition and performance over a wide range of platforms. It is highly versatile and used for a variety of audio applications, from music to sound design."},
    {"id": 40, "name": "Orca", "description": "Orca is an esoteric programming language and live coding environment for creating procedural sequencers. It is used for creating music and controlling MIDI devices in real-time, popular among experimental musicians."},
    {"id": 41, "name": "handel", "description": "handel is a live coding environment for music creation. It allows musicians to compose and perform music by writing code, enabling real-time manipulation of musical parameters and structures."},
    {"id": 42, "name": "Overtone", "description": "Overtone is a Clojure-based platform for live coding music. It leverages the SuperCollider synthesis engine to provide a powerful and flexible environment for creating music with code."},
    {"id": 43, "name": "Melrōse", "description": "Melrōse is a live coding environment for creating music. It allows musicians to compose and perform music by writing code, offering a range of tools for real-time manipulation of musical patterns and structures."},
    {"id": 44, "name": "Glicol", "description": "Glicol is a music live coding language written in Rust. It aims to be fast and expressive, enabling musicians to create complex musical patterns and structures in real-time."},
    {"id": 45, "name": "three.js", "description": "three.js is a popular JavaScript library for creating 3D graphics in the browser using WebGL. It provides a powerful and easy-to-use API for building interactive 3D applications, games, and visualizations."},
    {"id": 46, "name": "regl", "description": "regl is a functional WebGL framework that abstracts away the complexity of working with WebGL directly. It provides a simple and efficient way to create high-performance graphics applications in JavaScript."},
    {"id": 47, "name": "Stackgl", "description": "Stackgl is a collection of modular, low-level libraries for building WebGL applications. It provides a set of building blocks for creating custom graphics pipelines and real-time visualizations in the browser."},
    {"id": 48, "name": "Paper.js", "description": "Paper.js is an open-source vector graphics scripting framework that runs on top of the HTML5 canvas. It provides a powerful set of tools for creating and manipulating vector graphics programmatically."},
    {"id": 49, "name": "Pixi.js", "description": "Pixi.js is a fast and flexible 2D rendering engine for creating interactive graphics and animations. It provides a simple API for working with WebGL and HTML5 canvas, making it easy to create visually rich web applications."},
    {"id": 50, "name": "p5.js", "description": "p5.js is a JavaScript library that makes coding accessible for artists, designers, educators, and beginners. It is a companion to the Processing visual programming language, providing an easy way to create graphics and interactive content in the browser."},
    {"id": 51, "name": "Pts.js", "description": "Pts.js is a library for creating interactive and computational art with points, curves, and forms. It provides a simple and intuitive API for working with geometric primitives and creating complex visualizations."},
    {"id": 52, "name": "Fabric.js", "description": "Fabric.js is a powerful and flexible JavaScript library for working with the HTML5 canvas. It provides a range of tools for creating and manipulating objects on the canvas, making it easy to build interactive graphics applications."},
    {"id": 53, "name": "Maker.js", "description": "Maker.js is an open-source library for creating and working with vector graphics in JavaScript. It provides tools for creating, modifying, and exporting vector shapes, making it useful for both designers and developers."},
    {"id": 54, "name": "OpenJSCAD", "description": "OpenJSCAD is a JavaScript-based 3D modeling tool for creating and sharing parametric 3D models. It provides a script-based interface for defining 3D shapes and generating STL files for 3D printing."},
    {"id": 55, "name": "Sketch.js", "description": "Sketch.js is a lightweight JavaScript library for creating simple and intuitive graphics and animations. It provides a minimal API for working with the HTML5 canvas and creating interactive sketches."},
    {"id": 56, "name": "Two.js", "description": "Two.js is a two-dimensional drawing API for the web. It provides a scene graph and renderer for working with vector graphics, making it easy to create interactive and animated 2D graphics in the browser."},
    {"id": 57, "name": "ClayGL", "description": "ClayGL is a WebGL graphics library for creating interactive 3D graphics. It provides a comprehensive set of tools for working with 3D scenes, including support for lighting, shading, and animation."},
    {"id": 58, "name": "Proton", "description": "Proton is a lightweight and flexible JavaScript library for creating particle effects. It provides an easy-to-use API for defining and controlling particles, making it ideal for adding visual effects to web applications."},
    {"id": 59, "name": "lightgl.js", "description": "lightgl.js is a lightweight WebGL framework that simplifies the process of creating 3D graphics in the browser. It provides a minimal set of tools for working with WebGL, making it easy to get started with 3D graphics programming."},
    {"id": 60, "name": "picogl.js", "description": "picogl.js is a minimalistic WebGL 2 rendering library. It is designed to provide a thin layer over WebGL 2, making it easier to work with advanced graphics features while maintaining high performance."},
    {"id": 61, "name": "Alfrid", "description": "Alfrid is a collection of tools and utilities for WebGL and creative coding. It provides a range of modules for working with 3D graphics, shaders, and interactive visualizations."},
    {"id": 62, "name": "Babylon.js", "description": "Babylon.js is a powerful and open-source 3D engine for building games and visualizations. It provides a comprehensive set of tools for creating, rendering, and interacting with 3D content in the browser."},
    {"id": 63, "name": "twigl", "description": "twigl is a WebGL framework for creating and sharing live-coded shaders. It provides an intuitive environment for experimenting with real-time graphics and visual effects."},
    {"id": 64, "name": "luma.gl", "description": "luma.gl is a high-performance WebGL2 framework for GPU-powered data visualization and computation. It is designed to work seamlessly with deck.gl and provides a powerful set of tools for working with 3D graphics and shaders."},
    {"id": 65, "name": "css-doodle", "description": "css-doodle is a web component for drawing patterns with CSS. It allows developers to create complex and responsive designs using a simple and declarative syntax."},
    {"id": 66, "name": "OGL.js", "description": "OGL.js is a minimal WebGL framework that provides a simple API for creating 3D graphics. It is designed to be lightweight and modular, making it easy to integrate into existing projects and workflows."},
    {"id": 67, "name": "Zdog", "description": "Zdog is a JavaScript library for creating 3D graphics with a flat, design-friendly aesthetic. It provides an intuitive API for creating and animating shapes, making it easy to add 3D elements to web projects."},
    {"id": 68, "name": "Oimo.js", "description": "Oimo.js is a lightweight 3D physics engine for the web. It provides tools for simulating rigid body dynamics and collisions, making it ideal for creating interactive and physically-based applications."},
    {"id": 69, "name": "Ammo.js", "description": "Ammo.js is a JavaScript port of the Bullet Physics engine. It provides a comprehensive set of tools for simulating real-time physics in 3D applications, including support for rigid bodies, soft bodies, and constraints."},
    {"id": 70, "name": "Theatre.js", "description": "Theatre.js is a JavaScript library for creating and animating 2D and 3D graphics. It provides a powerful and flexible API for defining animations and interactions, making it easy to create dynamic and engaging visual content."},
    {"id": 71, "name": "GraphicsJS", "description": "GraphicsJS is a lightweight and powerful JavaScript library for creating and manipulating graphics. It provides a simple API for working with SVG and HTML5 canvas, making it easy to create interactive and animated graphics."},
    {"id": 72, "name": "MadMapper", "description": "MadMapper is a projection mapping software used for creating and controlling video projections. It provides a range of tools for mapping video onto physical surfaces, making it popular in the live events and art installation industries."},
    {"id": 73, "name": "VDMX", "description": "VDMX is a real-time video software for VJing and interactive installations. It provides a range of tools for mixing video, creating effects, and controlling visuals in real-time."},
    {"id": 74, "name": "Modul8", "description": "Modul8 is a software application designed for real-time video mixing and performance. It is widely used by VJs, artists, and musicians for creating dynamic and interactive visual shows."},
    {"id": 75, "name": "Resolume", "description": "Resolume is a live video mixing software used for creating real-time visual performances. It provides a range of tools for mixing video, adding effects, and synchronizing visuals with music."},
    {"id": 76, "name": "CoGe VJ", "description": "CoGe VJ is a semi-modular, Quartz Composer-based VJ software for live video mixing. It provides a range of tools for creating and manipulating visual content in real-time."},
    {"id": 77, "name": "VirtualMapper", "description": "VirtualMapper is a software tool for creating and managing projection mapping projects. It provides tools for aligning and mapping video onto physical surfaces, making it ideal for live events and installations."},
    {"id": 78, "name": "Millumin", "description": "Millumin is a software application for creating and managing multimedia shows. It is used for projection mapping, interactive installations, and live performances, providing tools for synchronizing visuals, audio, and lighting."},
    {"id": 79, "name": "Smode", "description": "Smode is a real-time compositing and media server software for creating and controlling visual content. It provides a range of tools for projection mapping, VJing, and interactive installations."},
    {"id": 80, "name": "Veejay", "description": "Veejay is an open-source, real-time video editing and performance tool. It allows users to mix and manipulate video clips in real-time, making it popular among VJs and video artists."},
    {"id": 81, "name": "Shadertoy", "description": "Shadertoy is an online community and platform for creating and sharing GLSL shaders. It provides an intuitive editor and real-time preview for experimenting with and showcasing shader code."},
    {"id": 82, "name": "Shader Park", "description": "Shader Park is an online tool for creating interactive 3D graphics using GLSL shaders. It provides a visual editor and real-time preview for developing and sharing shader-based art."},
    {"id": 83, "name": "GLSL Sandbox", "description": "GLSL Sandbox is an online platform for experimenting with GLSL shaders. It provides a simple editor and real-time preview for creating and sharing shader code."},
    {"id": 84, "name": "Shdr Editor", "description": "Shdr Editor is an online GLSL shader editor with real-time preview. It allows users to create, test, and share shaders in a collaborative environment."},
    {"id": 85, "name": "CodePen", "description": "CodePen is a social development environment for front-end designers and developers. It allows users to create and share code snippets, known as 'pens,' and provides an interactive editor for experimenting with HTML, CSS, and JavaScript."},
    {"id": 86, "name": "Shadershop", "description": "Shadershop is an online platform for creating and sharing GLSL shaders. It provides a visual editor and real-time preview for developing shader-based graphics and effects."},
    {"id": 87, "name": "Vertexshaderart", "description": "Vertexshaderart is an online platform for creating and sharing vertex shaders. It provides tools for experimenting with and visualizing real-time 3D graphics and effects."},
    {"id": 88, "name": "Cyos", "description": "Cyos is an online shader editor for creating and sharing GLSL shaders. It provides a simple and intuitive interface for experimenting with real-time graphics and visual effects."},
    {"id": 89, "name": "GlslEditor", "description": "GlslEditor is an online editor for creating and testing GLSL shaders. It provides a real-time preview and a range of tools for developing and sharing shader code."},
    {"id": 90, "name": "OpenProcessing", "description": "OpenProcessing is an online community and platform for sharing Processing sketches. It provides an interactive editor and a gallery for exploring and sharing creative coding projects."},
    {"id": 91, "name": "P5.js Editor", "description": "P5.js Editor is an online editor for creating and sharing p5.js sketches. It provides a user-friendly interface for experimenting with and developing interactive graphics and animations in the browser."},
    {"id": 92, "name": "LiveCodeLab", "description": "LiveCodeLab is an online environment for live coding music and visuals. It allows users to create real-time audio-visual performances using a simple and intuitive scripting language."},
    {"id": 93, "name": "Turtletoy", "description": "Turtletoy is an online platform for creating generative art using a simple turtle graphics language. It provides an interactive editor and a gallery for sharing and exploring creative coding projects."},
    {"id": 94, "name": "ShaderGif", "description": "ShaderGif is an online tool for creating animated GIFs from GLSL shaders. It provides a simple editor and real-time preview for developing and exporting shader-based animations."},
    {"id": 95, "name": "P5LIVE", "description": "P5LIVE is an online environment for live coding with p5.js. It provides tools for creating and performing interactive graphics and animations in real-time."},
    {"id": 96, "name": "NEORT", "description": "NEORT is an online platform for showcasing and selling digital art. It provides a gallery for exploring and purchasing artworks created with various digital tools and technologies."},
    {"id": 97, "name": "Shelly", "description": "Shelly is an online tool for creating generative art using cellular automata. It provides an interactive editor and a range of tools for experimenting with and visualizing complex patterns."},
    {"id": 98, "name": "tixy.land", "description": "tixy.land is an online platform for creating and sharing tiny generative art pieces. It provides a minimalistic editor for developing and visualizing creative coding projects with very little code."},
    {"id": 99, "name": "BBC Micro bot", "description": "BBC Micro bot is an online platform for creating and sharing programs for the BBC micro. It provides tools for writing code and simulating the micro's functionality in the browser."},
    {"id": 100, "name": "Hydra", "description": "Hydra is a live-coding environment for creating real-time visuals using JavaScript. It provides a range of tools for manipulating and compositing video streams, making it popular among VJs and digital artists."},
    {"id": 101, "name": "Arduino", "description": "Arduino is an open-source electronics platform based on easy-to-use hardware and software. It is widely used for creating interactive projects, from simple prototypes to complex installations."},
    {"id": 102, "name": "Raspberry Pi", "description": "Raspberry Pi is a low-cost, credit-card-sized computer that enables people of all ages to explore computing. It is used for a variety of projects, from simple DIY electronics to complex systems."},
    {"id": 103, "name": "Puck.js", "description": "Puck.js is a small, battery-powered JavaScript microcontroller that can be programmed wirelessly. It is designed for creating Internet of Things (IoT) projects and interactive devices."},
    {"id": 104, "name": "BeagleBoard", "description": "BeagleBoard is a low-power open-source hardware single-board computer. It is designed for education and hobbyist use, and supports various applications, from simple electronics projects to complex computing tasks."},
    {"id": 105, "name": "Makey Makey", "description": "Makey Makey is an invention kit for the 21st century that allows users to turn everyday objects into touchpads. It is used for educational purposes and creative projects, making it easy to prototype interactive devices."},
    {"id": 106, "name": "Leap Motion", "description": "Leap Motion is a motion control technology that captures the movement of hands and fingers. It is used for creating interactive applications and experiences that respond to natural hand gestures."},
    {"id": 107, "name": "AxiDraw", "description": "AxiDraw is a versatile and precise pen plotter. It is used for creating high-quality writing, drawing, and plotting on a variety of surfaces, making it popular among artists and designers."},
    {"id": 108, "name": "Phidgets", "description": "Phidgets are a set of user-friendly building blocks for creating electronics projects. They provide a range of sensors, actuators, and controllers that can be easily connected and programmed."},
    {"id": 109, "name": "Teensy", "description": "Teensy is a line of microcontroller development boards designed for making DIY electronics projects. It is popular for its small size, powerful features, and ease of use."},
    {"id": 110, "name": "Lightform", "description": "Lightform is a projection mapping device that allows users to create stunning visuals by mapping light onto real-world objects. It provides a range of tools for creating and controlling projection-mapped content."},
    {"id": 111, "name": "Structure Synth", "description": "Structure Synth is a cross-platform application for generating 3D structures by specifying a set of rules. It is used for creating complex and interesting shapes programmatically."},
    {"id": 112, "name": "F3", "description": "F3 is an open-source 3D modeling framework for creating and manipulating 3D shapes. It provides a range of tools for working with geometric primitives and creating complex models."},
    {"id": 113, "name": "Fragment", "description": "Fragment is a cross-platform GLSL shader editor. It provides a range of tools for developing, testing, and sharing shaders, making it easy to create real-time graphics and visual effects."},
    {"id": 114, "name": "ShaderTool", "description": "ShaderTool is an advanced editor for creating and testing shaders. It provides a range of features for developing complex visual effects and real-time graphics."},
    {"id": 115, "name": "Syphon", "description": "Syphon is an open-source framework for sharing video between applications on macOS. It is used for creating complex video processing pipelines and real-time visual performances."},
    {"id": 116, "name": "KodeLife", "description": "KodeLife is a real-time GPU shader editor for live-coding visual effects. It provides a range of tools for developing and testing GLSL shaders, making it popular among VJs and digital artists."},
    {"id": 117, "name": "ISF", "description": "ISF (Interactive Shader Format) is a file format for GLSL shaders that includes metadata for creating interactive visual effects. It is used for developing shaders that can be easily integrated into various applications."},
    {"id": 118, "name": "glslViewer", "description": "glslViewer is a command-line tool for viewing GLSL shaders. It provides a simple and lightweight environment for developing and testing real-time graphics and visual effects."},
    {"id": 119, "name": "DrawBot", "description": "DrawBot is a Mac application for creating 2D graphics and animations using Python. It provides a simple API for drawing shapes, text, and images, making it easy to create complex graphics programmatically."},
    {"id": 120, "name": "Klak", "description": "Klak is a set of tools for creating real-time interactive visuals using Unity. It provides a range of components for building and controlling visual effects, making it popular among VJs and digital artists."},
    {"id": 121, "name": "basil.js", "description": "basil.js is a JavaScript library for scripting Adobe InDesign. It provides a simple API for automating layout and design tasks, making it easy to create complex documents programmatically."},
    {"id": 122, "name": "Konstrukt", "description": "Konstrukt is an open-source framework for building interactive 3D web applications. It provides a range of tools for creating and manipulating 3D scenes, making it easy to develop immersive web experiences."}
    ]